# Задание 4: Вычисление объема усеченной пирамиды

def calculate_frustum_volume():
    print("--- Вычисление объема усеченной пирамиды ---")
    try:
        # Ввод данных пользователем
        s1 = float(input("Введите площадь верхнего основания: "))
        s2 = float(input("Введите площадь нижнего основания: "))
        h = float(input("Введите высоту пирамиды: "))

        # Формула объема: V = (h / 3) * (S1 + S2 + sqrt(S1 * S2))
        volume = (h / 3) * (s1 + s2 + (s1 * s2) ** 0.5)
        
        print(f"Объем усеченной пирамиды равен: {volume:.2f}")
        
    except ValueError:
        print("введите числовые значения")

if __name__ == "__main__":
    calculate_frustum_volume()